stroka = 'How are you doing?'

print(stroka[2]) # третий символ этой строки
print(stroka[-2]) # предпоследний символ этой строки
print(stroka[:5]) # первые пять символов этой строки
print(stroka[:-2]) # вся строка, кроме последних двух символов
print(stroka[1::2]) # все символы с четными индексами
print(stroka[0::2]) # все символы с нечетными индексами
print(stroka[::-1]) # все символы в обратном порядке
print(stroka[::-2]) # все символы строки через один в обратном порядке
print(len(stroka)) # длина данной строки
